// ======================================================
// Copyright (c) 2017-2026 the ReSDK_A3 project
// sdk.relicta.ru
// ======================================================

#include <Faith.h>

//_faithDesc = "Аккузат — Вера, широко распространённая за пределами Норы. Её последователи верят, что слепое бесстрашие и вера есть величайшие благодетели, в то время как страхи и сомнения — самые тяжкие грехи. Ненавидимы Фугу.";
addFaith("akkuzat","Аккузат",CLIENTSIDE_DESCRITION);

//_faithDesc = "Фугу — официальная религия Норы Номер Пять. Её приспешники убеждены, что лишь страх и трепет есть величайшая добродетель, поскольку именно он толкает человеческое существо на величайшие деяния, а слепая вера и бесстрашие — губительные пороки. Ненавидимы Аккузат.";
addFaith("fugu","Фугу",CLIENTSIDE_DESCRITION);


addFaith("kult","Оккультизм",CLIENTSIDE_DESCRITION);


