// ======================================================
// Copyright (c) 2017-2026 the ReSDK_A3 project
// sdk.relicta.ru
// ======================================================

#include <vices.h>
#include <..\text.hpp>


addViceTemplate("kleptomania","Клептомания","Ты испытываешь желание воровать у людей их вещи")
addViceTemplate("alcoholism","Алкоголизм","Ты зависим от выпивки. Ни дня без бутылки!")
addViceTemplate("nicotine","Курильщик","У тебя зависимость от никотина. Ты должен выкуривать одну сигарету раз в 15 минут")
addViceTemplate("sweet_tooth","Сладкоежка","Ты любишь сладкое")
addViceTemplate("drugs","Наркоман (зависимость)","У тебя зависимость от различных веществ")
addViceTemplate("glutton","Обжора","Тебе постоянно хочется кушать")
addViceTemplate("deaf","Глухота","У тебя глухота. Люди могут докричаться до тебя только находясь рядом")
addViceTemplate("blind","Слепота","У тебя плохое зрение")
addViceTemplate("neat","Чистюля","Чисти" + comma + " чисти! Ты должен быть чистым!")

addViceTemplate("masochism","Мазохист","Ты испытываешь удвольствие при получении увечий")
addViceTemplate("sex","Сексоголик","Ты озабоченный. Тебе хочется близости с противоположным полом")
addViceTemplate("necro","Некрофилия","Тебя неистово влечёт к мертвым телам")
addViceTemplate("copro","Копрофилия","Тебя привлекают фекалии. Поедай их" + comma + " мажь ими своё тело")
addViceTemplate("claustrophobia","Клаустрофобия","Ты не можешь находиться в закрытых пространствах")
addViceTemplate("pyrophobia","Пирофобия","Костры и факелы бросают тебя в дрожь. Ты до смерти боишься открытых источников огня")

addViceTemplate("no_tongue","Нет языка (увечье)","Ты лишился своего языка по тем или иным причинам. Общение возможно только с помощью жестов")
addViceTemplate("no_hand_r","Нет правой руки (увечье)","У тебя отсутствует правая рука")
addViceTemplate("no_hand_l","Нет левой руки (увечье)","У тебя отсутствует левая рука")
addViceTemplate("no_leg_r","Нет правой ноги (увечье)","У тебя отсутствует правая нога")
addViceTemplate("no_leg_l","Нет левой ноги (увечье)","У тебя отсутствует левая нога")
addViceTemplate("no_eye_r","Нет правого глаза (увечье)","Ты выбрал вилку. У тебя отсутствует правый глаз")
addViceTemplate("no_eye_l","Нет левого глаза (увечье)","Ты выбрал вилку. У тебя отсутствует левый глаз")

